#+title: Advent of Learning Code 2023 day 2
#+author: Garid Z.
#+date: [2023-12-01 Fri]
#+setupfile: ~/.config/emacs/org-templates/level-0-xelatex-fonts-conf.org
#+startup: show2levels


** Part I
#+begin_src emacs-lisp
(defun function-num-color-balls-at-single-showing (str-single-showed-colors) ;; e.g.    3 blue, 4 red
  (setq num-r-cubes 0
        num-g-cubes 0
        num-b-cubes 0)

  (setq eachcolorcubes (mapcar 'string-trim
                               (split-string str-single-showed-colors ",")))
  ;; ["3 blue", "4 red"]

  (while eachcolorcubes
    (setq tmp-num-and-color (string-split (pop eachcolorcubes) " "))
    (when (string= (nth 1 tmp-num-and-color) "red")
      (setq num-r-cubes (string-to-number (nth 0 tmp-num-and-color))))
    (when (string= (nth 1 tmp-num-and-color) "blue")
      (setq num-b-cubes (string-to-number (nth 0 tmp-num-and-color))))
    (when (string= (nth 1 tmp-num-and-color) "green")
      (setq num-g-cubes (string-to-number (nth 0 tmp-num-and-color))))
    )

  (list num-r-cubes num-g-cubes num-b-cubes))

(function-num-color-balls-at-single-showing "3 blue, 4 red")


(defun parse-each-game (str-signle-game-str-line) ;; 3 blue, 4 red; 1 red, 2 green, 6 blue; 2 green
  (setq
   tmp-list-of-list
   (mapcar
    'function-num-color-balls-at-single-showing
    (string-split str-signle-game-str-line ";")  ;; [ "3 blue, 4 red"   "1 red, 2 green, 6 blue"  "2 green" ]
    ))

  (setq max-r-cubes 0
        max-g-cubes 0
        max-b-cubes 0)

  (while tmp-list-of-list
    (setq a-tmp-list-of-num (pop tmp-list-of-list))
    (when (> (nth 0 a-tmp-list-of-num) max-r-cubes)
      (setq max-r-cubes (nth 0 a-tmp-list-of-num)))
    (when (> (nth 1 a-tmp-list-of-num) max-g-cubes)
      (setq max-g-cubes (nth 1 a-tmp-list-of-num)))
    (when (> (nth 2 a-tmp-list-of-num) max-b-cubes)
      (setq max-b-cubes (nth 2 a-tmp-list-of-num)))
    )
  (list max-r-cubes max-g-cubes max-b-cubes))



(parse-each-game " 3 blue, 4 red; 1 red, 2 green, 6 blue; 2 green ")

(defun compare-max-possible-value (max-rgb-val compare-values)
  (setq retval t)
  (when (> (nth 0 max-rgb-val) (nth 0 compare-values)) (setq retval nil))
  (when (> (nth 1 max-rgb-val) (nth 1 compare-values)) (setq retval nil))
  (when (> (nth 2 max-rgb-val) (nth 2 compare-values)) (setq retval nil))
  retval)

(compare-max-possible-value
 (parse-each-game " 3 blue, 4 red; 1 red, 2 green, 6 blue; 2 green ")
 '(12 13 14) )
#+end_src

#+RESULTS:
: t

#+header: :var test-data=lst-data-test
#+header: :var real-data=lst-data-real
#+begin_src emacs-lisp
(setq var-txt-lines (split-string (string-trim real-data) "\n"))
;; (setq var-txt-lines (split-string (string-trim test-data) "\n"))
#+end_src

#+RESULTS:


#+begin_src emacs-lisp
(setq tmp-var-txt-lines var-txt-lines)
(setq var-okay-game-list (list))

(while tmp-var-txt-lines
  (setq gamenum-n-gamestr (string-split (pop tmp-var-txt-lines) ":"))
  (when (compare-max-possible-value
         (parse-each-game (nth 1 gamenum-n-gamestr))
         '(12 13 14))
    (push (nth 0 gamenum-n-gamestr) var-okay-game-list)))


(-sum (mapcar
       (lambda (x)
         (string-to-number (nth 1 (string-split x " "))))
       var-okay-game-list))
#+end_src

#+RESULTS:
: 2545
** Part II
#+header: :var test-data=lst-data-test
#+header: :var real-data=lst-data-real
#+begin_src emacs-lisp
(setq var-txt-lines (split-string (string-trim real-data) "\n"))
;; (setq var-txt-lines (split-string (string-trim test-data) "\n"))
#+end_src


#+begin_src emacs-lisp
(setq tmp-var-txt-lines var-txt-lines)
(setq list-of-multiplied-val-of-rgb (list))

(while tmp-var-txt-lines
  (setq gamenum-n-gamestr (string-split (pop tmp-var-txt-lines) ":"))
  (push
   (-product (parse-each-game (nth 1 gamenum-n-gamestr)))
   list-of-multiplied-val-of-rgb ))


(-sum list-of-multiplied-val-of-rgb)
#+end_src

#+RESULTS:
: 78111

